#ifndef H_TEGIA_DB_MYSQL_CONST
#define H_TEGIA_DB_MYSQL_CONST

////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                        //
// DEFINES                                                                                //
//                                                                                        //
////////////////////////////////////////////////////////////////////////////////////////////

//	Определяем типы ошибок
	#define DB_ERROR                1000000   // Префикс типа ошибок MySQL
	#define DB_ERROR_INIT           1010000   // Ошибка при инициализации объекта соединения с БД (нехватка памяти)

	#define ER_DUP_ENTRY               1062


////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                        //
// CONSTANTS                                                                              //
//                                                                                        //
////////////////////////////////////////////////////////////////////////////////////////////


namespace tegia {
namespace mysql {

	const int RES_DUP =	1001062;
	const int RES_OK =	200;

	//
	// Генерировать ошибку, в случае, если возникло дублирование записи по уникальному ключу
	//

	const int ON_DUPLICATE_ERROR  = 100;

	//
	// Обновлять запись в БД, в случае, если возникло дублирование записи по уникальному ключу
	//
	
	const int ON_DUPLICATE_UPDATE = 200;

}	// END namespace mysql
}	// END namespace tegia



#endif