#!/bin/sh


# ===========================================================================

RED=`tput setaf 1`
GREEN=`tput setaf 2`
RESET=`tput sgr0`

echo "${GREEN}============================================================="
echo " RealCase Installer 1.0.0 "
echo "=============================================================${RESET}"

# -----------------------------------------------------------------------------------------------------
#   Выгружаем репозиторий
# -----------------------------------------------------------------------------------------------------

echo " "
echo "Выгружаем репозиторий"

param=true

while [ param ]
do
	RESULT=$(git clone https://gitlab.com/tegia-acm/tegia-node.git ./platform/ 2>&1 || true) 
    
    echo " "
    echo $RESULT

	if [ -d "./platform" ]
	then
		echo "${GREEN}[!] Репозиторий выгружен${RESET}"	
		echo " "
		break
	else
		echo "${RED}[!] Репозиторий не выгружен. Повторите ввод логина и пароля${RESET}"	
		echo " "
	fi
done



echo "${GREEN}============================================================="
echo "Установка TEGIA Platform завершена"	
echo "=============================================================${RESET}"

exit 0